---
kind: method
id: M:Autodesk.Revit.DB.CurveArrArray.GetEnumerator
source: html/1cf2c785-23ee-4ea2-5804-90b7b47b9080.htm
---
# Autodesk.Revit.DB.CurveArrArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.